import sys
sys.path.append('/data/group/800442/800319/AWorkHandOver/alphaResearch/dataUpdate/')
sys.path.append('/data/group/800442/800319/')

from dataApi.getData import get_daily_1factor
from dataApi.tradeDate import get_recent_trade_date
from dataApi.sendInfo import send_message
from dataApi.indName import sw_level2, sw2021_level2
import pandas as pd
import os

DROP_IND_MAP = {
    20210105: [],
    20211013: ['燃气Ⅱ', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '燃气', '天然气', '页岩气', '种植业与林业', '电力', '煤炭开采加工', '风电', '港口航运'],
    20211104: ['采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '风电', '港口航运', '光伏'],
    20211105: ['CRO概念', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '风电', '港口航运', '光伏'],
    20211111: ['CRO概念', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '风电', '港口航运', '光伏', '半导体及元件', '第三代半导体', '光刻胶'],
    20211115: ['CRO概念', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '风电', '港口航运', '光伏', '半导体及元件', '第三代半导体', '光刻胶',
               '盐湖提锂', '锂电池', '基础化学', '化工新材料', '氟化工', '磷化工', '有机硅'],
    20211122: ['CRO概念', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅'],
    20211125: ['CRO概念', '采掘服务Ⅱ', '石油开采Ⅱ', '石油化工', '石油加工贸易', '油气开采及服务',
               '页岩气', '电力', '煤炭开采加工', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '风电', '光伏'],
    20211207: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '页岩气', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '光伏', '盐湖提锂', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '航空装备'],
    20211208: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '页岩气', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '光伏', '盐湖提锂', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '航空装备', '烟草', '稀土永磁', '电力物联网', '云游戏'],
    20211209: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '页岩气', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '光伏', '盐湖提锂', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '航空装备', '烟草', '稀土永磁', '云游戏', '储能', '国产航母'],
    20211210: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '页岩气', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '航空装备', '烟草', '稀土永磁', '储能', '国产航母'],
    20211214: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '页岩气', '港口航运', '半导体及元件', '基础化学', '化工新材料',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '航空装备', '烟草', '稀土永磁', '储能', '国产航母', '工业母机'],
    20211216: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '烟草', '稀土永磁', '国产航母', '航空装备Ⅱ'],
    20211217: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件', '盐湖提锂',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '烟草', '稀土永磁', '国产航母', '航空装备Ⅱ', 'HIT电池', 'Wind884045'],
    20220104: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件', '盐湖提锂', '储能', '风电', '生物制品', '光伏概念', '医疗服务Ⅱ',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '胎压监测', '烟草', '稀土永磁', '国产航母', '航空装备Ⅱ', 'HIT电池', 'Wind884045'],
    20220112: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件', '盐湖提锂', '储能', '风电', '生物制品', '光伏概念', '医疗服务Ⅱ',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '稀土永磁', '国产航母', '航空装备Ⅱ', 'HIT电池'],
    20220118: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件', '盐湖提锂', '储能', '风电', '生物制品', '光伏概念', '医疗服务Ⅱ',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '稀土永磁', '国产航母', '航空装备Ⅱ', 'HIT电池',
               '氢能源', '体育产业', '新冠检测', '预制菜', '养鸡'],
    20220120: ['CRO概念', '石油加工贸易', '油气开采及服务',
               '半导体及元件', '盐湖提锂', '储能', '风电', '生物制品', '光伏概念', '医疗服务Ⅱ',
               '氟化工', '磷化工', '有机硅', '锂电池', '第三代半导体',
               '光刻胶', '稀土永磁', '国产航母', 'HIT电池',
               '氢能源', '体育产业', '新冠检测', '预制菜', '国防军工', '胎压监测', 'EDR概念'],
    20220208: ['CRO概念', '新冠治疗', '新冠检测', '半导体及元件', '第三代半导体', '光刻胶',
               '储能', 'HJT电池', '电力设备', '锂电池', '盐湖提锂', '光伏概念', '白酒概念',
               '无人驾驶', '汽车电子', '生物制品Ⅱ'],
    20220211: ['CRO概念', '新冠治疗', '新冠检测', '半导体及元件', '第三代半导体', '光刻胶',
               '储能', 'HJT电池', '电力设备', '锂电池', '盐湖提锂', '光伏概念', '白酒概念',
               '无人驾驶', '汽车电子', '生物制品Ⅱ', '国防军工', '消费电子', '元件Ⅱ'],
    20220215: ['CRO概念', '新冠治疗', '新冠检测', '半导体及元件', '第三代半导体', '光刻胶',
               '储能', 'HJT电池', '锂电池', '光伏概念',
               '无人驾驶', '汽车电子', '生物制品Ⅱ', '国防军工', '消费电子', '元件Ⅱ'],
    20220223: ['新冠治疗', '新冠检测'],
    20220225: ['新冠治疗', '新冠检测', 'NFT概念', '影视院线'],
    20220303: ['NFT概念', '影视院线', '工程机械', '商用车', '白色家电', '小家电', '厨卫电器', '证券Ⅱ', '互联网电商',
               '专业服务', '数字媒体', '摩托车及其他', '电池', '消费电子', '汽车零部件'],
    20220304: ['NFT概念', '影视院线', '工程机械', '商用车', '白色家电', '小家电', '厨卫电器', '证券Ⅱ', '互联网电商',
               '专业服务', '数字媒体', '摩托车及其他', '电池', '消费电子', '汽车零部件', '元件', '光学光电子', '黑色家电'],
    20220309: {'THS': ['NFT概念', '油气开采及服务', '中俄贸易概念', '燃气', '黄金概念', '港口航运'],
               'SW2': ['影视院线', '工程机械', '厨卫电器', '证券Ⅱ', '互联网电商',
               '专业服务', '数字媒体', '摩托车及其他', '电池', '消费电子', '汽车零部件',
               '航天装备Ⅱ', '地面兵装Ⅱ', '军工电子Ⅱ', '航海装备Ⅱ', '照明设备Ⅱ', '自动化设备', '塑料']},
    20220310: {'THS': ['中俄贸易概念', '黄金概念', '港口航运', '页岩气'],
               'SW2': ['影视院线', '工程机械', '厨卫电器', '证券Ⅱ', '互联网电商',
                       '专业服务', '数字媒体', '摩托车及其他', '消费电子', '汽车零部件',
                       '航天装备Ⅱ', '地面兵装Ⅱ', '航海装备Ⅱ', '照明设备Ⅱ', '自动化设备', '塑料',
                       '燃气Ⅱ', '油服工程', '休闲食品', '白色家电', '广告营销', '炼化及贸易',
                       '玻璃玻纤', '航空机场', '燃气Ⅱ', '油服工程']},
    20220311: {'THS': ['中俄贸易概念', '黄金概念', '港口航运', '页岩气'],
               'SW2': ['影视院线', '厨卫电器', '互联网电商',
                       '专业服务', '数字媒体', '摩托车及其他', '消费电子', '汽车零部件',
                       '航天装备Ⅱ', '地面兵装Ⅱ', '航海装备Ⅱ', '自动化设备',
                       '燃气Ⅱ', '油服工程', '休闲食品', '白色家电', '广告营销', '炼化及贸易',
                       '玻璃玻纤', '航空机场', '油服工程']},
    20220318: {'THS': ['新冠检测', '东数西算（算力）', '俄乌冲突概念', '黄金概念'],
               'SW2': ['休闲食品', '自动化设备', '互联网电商', '专业服务', '数字媒体', '摩托车及其他', '广告营销',
                       '炼化及贸易', '玻璃玻纤', '航天装备Ⅱ', '地面兵装Ⅱ', '航海装备Ⅱ', '航运港口',
                       '油服工程', '燃气Ⅱ', '环保设备Ⅱ']},
    20220321: {'THS': ['俄乌冲突概念', '黄金概念'],
               'SW2': ['休闲食品', '自动化设备', '互联网电商', '专业服务', '数字媒体', '摩托车及其他', '广告营销',
                       '炼化及贸易', '玻璃玻纤', '航天装备Ⅱ', '地面兵装Ⅱ', '航海装备Ⅱ', '航运港口',
                       '油服工程', '燃气Ⅱ', '环保设备Ⅱ']},
    20220421: {'THS': [],
               'SW2': sorted(list(set(sw2021_level2.values()) -
                   {'白色家电',
                    '小家电',
                    '厨卫电器',
                    '食品加工',
                    '白酒Ⅱ',
                    '非白酒',
                    '饮料乳品',
                    '休闲食品',
                    '调味发酵品Ⅱ',
                    '纺织制造',
                    '服装家纺',
                    '物流',
                    '铁路公路',
                    '证券Ⅱ',
                    '保险Ⅱ',
                    '贸易Ⅱ',
                    '专业服务',
                    '酒店餐饮',
                    '国有大型银行Ⅱ',
                    '股份制银行Ⅱ',
                    '城商行Ⅱ',
                    '农商行Ⅱ',
                    '化妆品',
                    '航运港口',
                    '电视广播Ⅱ'}))}
}

if __name__ == '__main__':
    date = get_recent_trade_date()
    address = f'/data/group/800442/800319/restrict_industry/{date}/'
    if not os.path.exists(address): os.makedirs(address)
    drop_date = [x for x in DROP_IND_MAP if x <= date][-1]

    to_drop = DROP_IND_MAP[drop_date]['SW2']

    sw_drop1 = [x for x in to_drop if x in sw_level2.values()]
    sw_drop_code1 = [x for x in sw_level2 if sw_level2[x] in sw_drop1]
    sw21 = get_daily_1factor('SW2', [date]).iloc[0].map(sw_level2)
    sw21 = sw21[sw21.isin(to_drop)].index.to_list()

    sw_drop2 = [x for x in to_drop if x in sw2021_level2.values()]
    sw_drop_code2 = [x for x in sw_level2 if sw_level2[x] in sw_drop2]
    sw22 = get_daily_1factor('SW20212', [date]).iloc[0].map(sw2021_level2)
    sw22 = sw22[sw22.isin(to_drop)].index.to_list()
    sw_drop = sw_drop1 + sw_drop2
    sw_drop_code = sorted(list(set(sw_drop_code1 + sw_drop_code2)))
    to_drop = list((set(to_drop) | set(DROP_IND_MAP[drop_date]['THS'])) - set(sw_drop1) - set(sw_drop2))
    drop_code_list = sorted(list(set(sw21) | set(sw22)))


    json_date = sorted([x for x in os.listdir('/data/group/800442/800319/Afengchi/概念板块同花顺/') if (
            x[-5:] == '.json') & (x[:7] == '概念板块同花顺')])[-1]
    ths_ind = pd.read_json('/data/group/800442/800319/Afengchi/概念板块同花顺/' +
                           json_date).stack().reset_index().iloc[:, :2]['level_1'].to_list()
    ths_drop = [x for x in to_drop if x in ths_ind]
    concept = pd.read_json('/data/group/800442/800319/Afengchi/概念板块同花顺/'
                           + json_date).stack().reset_index().iloc[:, :2]
    concept.columns = ['code', '概念板块']
    concept = concept.set_index('code')
    drop_stock_list = concept[concept['概念板块'].isin(ths_drop)].index.to_list()


    # to_drop = list(set(to_drop) - set(ths_drop))
    # json_date = sorted([x for x in os.listdir('/data/group/800442/800319/zxf/') if (
    #         x[-5:] == '.json') & (x[:7] == '概念板块同花顺')])[-1]
    # ths_ind = pd.read_json('/data/group/800442/800319/zxf/' +
    #                        json_date).stack().reset_index().iloc[:, :2]['level_1'].to_list()
    # ths_drop2 = [x for x in to_drop if x in ths_ind]
    # concept = pd.read_json('/data/group/800442/800319/zxf/'
    #                        + json_date).stack().reset_index().iloc[:, :2]
    # concept.columns = ['code', '概念板块']
    # concept = concept.set_index('code')
    # drop_stock_list2 = concept[concept['概念板块'].isin(ths_drop2)].index.to_list()
    # drop_stock_list = sorted(list(set(int(x[:-3]) for x in (drop_stock_list1 + drop_stock_list2))))

    to_drop = list(set(to_drop) - set(ths_drop))
    # ths_drop += ths_drop2


    # add0208 = pd.read_excel(f'{address}/../网络游戏指数.xlsx')['代码'].to_list()
    # drop_code_list = sorted(list(set(set(drop_code_list) | set([int(x[:6]) for x in add0208]))))
    drop_code_list = sorted(list(set(drop_code_list)))
    send_message('015836', f'SW2限制交易:{sorted(list(set(sw_drop)))}, 同花顺限制交易：{sorted(list(set(ths_drop)))}')
    send_message('015836', '未匹配到' + str(to_drop))
    pd.to_pickle(sw_drop_code, f'{address}/申万二级归零行业.pkl')
    pd.to_pickle(ths_drop, f'{address}/同花顺归零行业.pkl')
    pd.to_pickle(drop_code_list, f'{address}/drop_code_list.pkl')



